package lesson2;

import kotlin.NotImplementedError;
import kotlin.Pair;

@SuppressWarnings("unused")
public class JavaAlgorithms {
    /**
     * Получение наибольшей прибыли (она же -- поиск максимального подмассива)
     * Простая
     *
     * Во входном файле с именем inputName перечислены цены на акции компании в различные (возрастающие) моменты времени
     * (каждая цена идёт с новой строки). Цена -- это целое положительное число. Пример:
     *
     * 201
     * 196
     * 190
     * 198
     * 187
     * 194
     * 193
     * 185
     *
     * Выбрать два момента времени, первый из них для покупки акций, а второй для продажи, с тем, чтобы разница
     * между ценой продажи и ценой покупки была максимально большой. Второй момент должен быть раньше первого.
     * Вернуть пару из двух моментов.
     * Каждый момент обозначается целым числом -- номер строки во входном файле, нумерация с единицы.
     * Например, для приведённого выше файла результат должен быть Pair(3, 4)
     *
     * В случае обнаружения неверного формата файла бросить любое исключение.
     */
    static public Pair<Integer, Integer> optimizeBuyAndSell(String inputName) {
        throw new NotImplementedError();
    }

    /**
     * Задача Иосифа Флафия.
     * Простая
     *
     * Образовав круг, стоят menNumber человек, пронумерованных от 1 до menNumber.
     *
     * 1 2 3
     * 8   4
     * 7 6 5
     *
     * Мы считаем от 1 до choiceInterval (например, до 5), начиная с 1-го человека по кругу.
     * Человек, на котором остановился счёт, выбывает.
     *
     * 1 2 3
     * 8   4
     * 7 6 х
     *
     * Далее счёт продолжается со следующего человека, также от 1 до choiceInterval.
     * Выбывшие при счёте пропускаются, и человек, на котором остановился счёт, выбывает.
     *
     * 1 х 3
     * 8   4
     * 7 6 Х
     *
     * Процедура повторяется, пока не останется один человек. Требуется вернуть его номер (в данном случае 3).
     *
     * 1 Х 3
     * х   4
     * 7 6 Х
     *
     * 1 Х 3
     * Х   4
     * х 6 Х
     *
     * х Х 3
     * Х   4
     * Х 6 Х
     *
     * Х Х 3
     * Х   х
     * Х 6 Х
     *
     * Х Х 3
     * Х   Х
     * Х х Х
     *
     * Общий комментарий: решение из Википедии для этой задачи принимается,
     * но приветствуется попытка решить её самостоятельно.
     */
    static public int josephTask(int menNumber, int choiceInterval) {
        throw new NotImplementedError();
    }

    /**
     * Наибольшая общая подстрока.
     * Средняя
     *
     * Дано две строки, например ОБСЕРВАТОРИЯ и КОНСЕРВАТОРЫ.
     * Найти их самую длинную общую подстроку -- в примере это СЕРВАТОР.
     * Если общих подстрок нет, вернуть пустую строку.
     * При сравнении подстрок, регистр символов *имеет* значение.
     * Если имеется несколько самых длинных общих подстрок одной длины,
     * вернуть ту из них, которая встречается раньше в строке first.
     */
    // Трудоемкость O(n * m)
    // Ресурсоемкость O(1)
    static public String longestCommonSubstring(String first, String second) {
        int start = 0;
        int max = 0;
        int counter;
        // последовательно проходим по главной диагонали матрицы и по диагоналям, которые выше главной
        // за главную, принимаю диагональ a[i][i]
        //    с р  е д а
        //   ____________
        // е  \. . . . . |
        // д  . \. . . . |
        // а  . .\ . . . |
        //        -------
        for (int diag = 0; diag < second.length(); diag++) {
            counter = 0;
            for (int i = 0; i < first.length(); i++) {
                if (i + diag >= second.length()) {
                    continue;
                }
                if (first.charAt(i) == second.charAt(i + diag)) {
                    counter++;
                    if (counter > max) {
                        max = counter;
                        start = i;
                    }
                } else {
                    counter = 0;
                }
            }
        }
        // последовательно проходим по главной диагоналям матрицы, которые ниже главной
        //    с р е д а
        // е |\.. . . .
        // д |.\. . . .
        // а |..\ . . .
        //   ----
        for (int diag = 1; diag < first.length(); diag++) {
            counter = 0;
            for (int j = 0; j < second.length(); j++) {
                if (j + diag >= first.length()) {
                    continue;
                }
                if (second.charAt(j) == first.charAt(j + diag)) {
                    counter++;
                    if (counter > max) {
                        max = counter;
                        start = j + diag;
                    }
                } else {
                    counter = 0;
                }
            }
        }
        return first.substring(start - max + 1, start + 1);
    }
    /**
     * Число простых чисел в интервале
     * Простая
     *
     * Рассчитать количество простых чисел в интервале от 1 до limit (включительно).
     * Если limit <= 1, вернуть результат 0.
     *
     * Справка: простым считается число, которое делится нацело только на 1 и на себя.
     * Единица простым числом не считается.
     */
    // Трудоемкость O(n log(log n))
    // Ресурсоемкость O(n)
    static public int calcPrimesNumber(int limit) {
        if (limit <= 1) {
            return 0;
        }
        int counter = limit - 1;
        boolean[] array = new boolean[limit + 1];
        for (int i = 2; i * i <= limit; i++) {
            if (!array[i]) {
                for (int j = i * i; j <= limit; j += i) {
                    if (!array[j]) {
                        array[j] = true;
                        counter--;
                    }
                }
            }
        }
        return counter;
    }
}
